emacs/.emacs.d/lisp/init-mu4e.org

#+TITLE:	mu4e Configuration
#+AUTHOR:	Jaxson Van Doorn
#+EMAIL:	jaxson.vandoorn@gmail.com
#+OPTIONS:  num:nil

* Plug-Ins
** Load mu4e
 #+BEGIN_SRC emacs-lisp
 (load-all-in-directory "/usr/local/share/emacs/site-lisp/mu4e")
 ;;(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
 #+END_SRC
* Behavior
** Mail Location
 #+BEGIN_SRC emacs-lisp
 (setq mu4e-maildir (expand-file-name "~/mail"))
 #+END_SRC
** Shortcuts
 #+BEGIN_SRC emacs-lisp
 (setq mu4e-maildir-shortcuts
       '(("/INBOX"             . ?i)
         ("/[Gmail].Sent Mail" . ?s)
         ("/[Gmail].Trash"     . ?t)))
 #+END_SRC
** Folders
 #+BEGIN_SRC emacs-lisp
 (setq mu4e-drafts-folder "/[Gmail].Drafts")
 (setq mu4e-sent-folder   "/[Gmail].Sent Mail")
 (setq mu4e-trash-folder  "/[Gmail].Trash")
 #+END_SRC
** Info
 #+BEGIN_SRC emacs-lisp
 (setq
  user-mail-address "woofers1tt@gmail.com"
  user-full-name  "Jaxson Van Doorn")
 #+END_SRC
** Delete Sent Messages
 #+BEGIN_SRC emacs-lisp
 (setq mu4e-sent-messages-behavior 'delete)
 #+END_SRC
** Update Mail
 #+BEGIN_SRC emacs-lisp
 (setq mu4e-get-mail-command "offlineimap")
 #+END_SRC
** Blanket
 #+BEGIN_SRC emacs-lisp
   (require 'smtpmail)

   (setq message-send-mail-function 'smtpmail-send-it
         starttls-use-gnutls t
         smtpmail-starttls-credentials
         '(("smtp.gmail.com" 587 nil nil))
         smtpmail-auth-credentials
         (expand-file-name "~/.authinfo.gpg")
         smtpmail-default-smtp-server "smtp.gmail.com"
         smtpmail-smtp-server "smtp.gmail.com"
         smtpmail-smtp-service 587
         smtpmail-debug-info t)
 #+END_SRC
* Functions
* Mappings
* Hooks
* Provide init-mu4e as a Package
#+BEGIN_SRC emacs-lisp
(provide 'init-mu4e)
#+END_SRC
